<template>
    <div class=" bg-primary w-full p-12">
        <h1 class=" font-semibold text-xl text-complement-darker">
            นโยบายความเป็นส่วนตัว
        </h1>
        <div class=" p-4 bg-white shadow rounded mt-4">
            <ul class=" list-outside list-disc pl-4">
                <li class="my-2">
                    เราเก็บข้อมูลส่วนบุคคลของท่านจากระบบพิสูจน์ตัวตนขององค์กรที่ท่านใช้ login ซึ่งได้แก่ ชื่อ และ รหัสพนักงาน
                </li>
                <li class="my-2">
                    เราเก็บข้อมูลส่วนบุคคลของท่านจาก LINE หรือ Telegram ตามความยินยอมของท่าน ซึ่งได้แก่ รหัสผู้ใช้งาน ชื่อผู้ใช้งาน รูปโปรไฟล์ ข้อความสถานะและอีเมล์ โดยรหัสผู้ใช้งานเป็นข้อมูลจำเป็นข้อมูลเดียว สำหรับข้อมูลอื่น ท่านสามารถเลือกที่จะไม่ให้ระบบจัดเก็บไว้ก็ได้
                </li>
                <li class="my-2">
                    เราเก็บข้อมูลส่วนบุคคลของท่านได้แก่ หมายเลขโทรทศัพท์ ตามที่ท่านให้ไว้ในขั้นตอนสมัครใช้งาน
                </li>
                <li class="my-2">
                    เราเก็บข้อมูลการใช้งานของท่าน
                </li>
            </ul>
        </div>
        <div class=" p-4 bg-white shadow rounded mt-4">
            <ul class=" list-outside list-disc pl-4">
                <li class="my-2">
                    เราใช้ข้อมูลส่วนบุคคลของท่านจากระบบพิสูจน์ตัวตนขององค์กรเพื่อป้องกันการใช้งานโดยไม่ได้รับอนุญาต
                </li>
                <li class="my-2">
                    เราใช้ข้อมูลส่วนบุคคลของท่านจาก LINE หรือ Telegram เพื่อให้บริการการสื่อสารระหว่างท่านกับระบบ
                </li>
                <li class="my-2">
                    เราใช้ข้อมูลหมายเลขโทรทศัพท์ของท่านเพื่อติดต่อในกรณีที่ไม่สามารถสื่อสารผ่านทาง LINE หรือ Telegram หรือในกรณีฉุกเฉินเท่านั้น
                </li>
                <li class="my-2">
                    เราใช้ข้อมูลการใช้งานของท่านเพื่อช่วยเหลือท่านในกรณีเกิดปัญหาการใช้งานและปรับปรุงบริการให้ดียิ่งขึ้น
                </li>
            </ul>
        </div>

        <div class=" p-4 bg-white shadow rounded mt-4">
            <ul class=" list-outside list-disc pl-4">
                <li class="my-2">
                    เราไม่เปิดเผยหรือถ่ายโอนข้อมูลส่วนบุคคลและการใช้งานของท่านไปยังบุคคลภายนอกทุกกรณี เว้นแต่เป็นไปตามข้อบังคับทางกฎหมาย
                </li>
                <li class="my-2">
                    เราไม่แสดงข้อมูลส่วนบุคคลของท่านโดยปริยาย มีเพียงผู้ดูแลระบบที่เข้าถึงข้อมูลนี้และจะมีบันทึกการเข้าถึงข้อมูลทุกครั้ง ซึ่งการเข้าถึงข้อมูลของผู้ดูแลระบบเป็นไปเพื่อการจัดการ เช่น ในการเปิดสิทธิ์การใช้งาน จำเป็นต้องแสดง ชื่อ ผู้ใช้งาน เป็นต้น
                </li>
                <li class="my-2">
                    เราไม่มีการใช้คุกกี้ (Cookies) เพื่อติดตาม แสดงโฆษณา หรือรวบรวมการใช้งานเว็บไซต์อื่นๆ ของท่านในระบบของเรา มีการใช้งานคุกกี้ที่จำเป็นต่อการจดจำบัญชีผู้ใช้ของท่านเท่านั้น
                </li>
            </ul>
        </div>

        <h2 class=" font-semibold text-xl text-complement-darker mt-6">
            ข้อตกลงการใช้งาน
        </h2>

        <div class=" p-4 bg-white shadow rounded mt-4">
            <ul class=" list-outside list-disc pl-4">
                <li class="my-2">
                    ไม่อนุญาตให้ท่านใช้บัญชีผู้ใช้งานร่วมกัน ตัวท่านไม่ใช้บัญชีของผู้อื่นและไม่มอบบัญชีของท่านให้ผู้อื่นใช้
                </li>
                <li class="my-2">
                    ขณะนี้ระบบอยู่ระหว่างการพัฒนา หากพบข้อผิดพลาดในการใช้งาน ท่านสามารถแจ้งปัญหาได้ที่เมนู Helpdesk ทางทีมพัฒนาต้องขออภัยในความไม่สะดวก
                </li>
                <li class="my-2">
                    ความเห็นและข้อเสนอแนะของท่านสามารถช่วยให้เราพัฒนาบริการได้ดียิ่งขึ้น
                </li>
            </ul>
        </div>
    </div>
</template>

<script setup>
defineProps({
    // eslint-disable-next-line vue/require-default-prop
    layout: null,
});
</script>
